src/Documents/ИТСервисы_РегистрацияДокументацииИТСервиса/ИТСервисы_РегистрацияДокументацииИТСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_РегистрацияДокументацииИТСервиса</name>
  <registerRecords>InformationRegister.ИТСервисы_ПараметрыИТСервисов</registerRecords>
  <registerRecords>InformationRegister.ИТСервисы_ДокументацияСервисов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументацияСервиса</name>
    <attributes>
      <name>ТипДокументации</name>
      <type>
        <types>CatalogRef.ИТСервисы_ТипыДокументацииСервисов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ИТСервисы_СтатусыДокументации</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеРеквизитов</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутиИСсылки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АвторДокумента</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИТСервисы_ДокументацияСервисов/ИТСервисы_ДокументацияСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_ДокументацияСервисов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыДокументации</types>
    </type>
  </resources>
  <resources>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеРеквизитов</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПутиИСсылки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДокументации</name>
    <type>
      <types>CatalogRef.ИТСервисы_ТипыДокументацииСервисов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИТСервисы_ПараметрыИТСервисов/ИТСервисы_ПараметрыИТСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_ПараметрыИТСервисов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НаРазвитии</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НаСопровождении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПланПроектаВИСУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодВАРМРазработчика</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДорожнаяКарта</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриказОВводеВПЭ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПаспортСервиса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Архитектура</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БазаЗнаний</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорТП</name>
    <type>
      <types>Boolean</types>
      <types>DocumentRef.ИТСервисы_ДоговорСТехническимПровайдером</types>
    </type>
  </resources>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ИТСервисы_ТипыДокументацииСервисов/ИТСервисы_ТипыДокументацииСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИТСервисы_ТипыДокументацииСервисов</name>
  <predefined>
    <items>
      <name>Архитектура</name>
      <description>Архитектура</description>
    </items>
    <items>
      <name>БазаЗнаний</name>
      <description>База знаний</description>
    </items>
    <items>
      <name>ПаспортИТСервиса</name>
      <description>Паспорт ИТ-Сервиса</description>
    </items>
    <items>
      <name>ДорожнаяКарта</name>
      <description>Дорожная карта развития</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательнаяДокументация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ИТСервисы_РегистрацияДокументацииИТСервиса/ObjectModule.bsl
// Модуль объекта документа РегистрацияДокументацииСервиса

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт

    // 1. Движения по документации (оставляем как было, только улучшаем)
    Движения.ИТСервисы_ДокументацияСервисов.Записывать = Истина;
    Движения.ИТСервисы_ДокументацияСервисов.Очистить();

    Если НЕ ЗначениеЗаполнено(ИТСервис) Тогда
        //ОбщегоНазначения.СообщитьПользователю("Не указан ИТ-сервис!", , "ИТСервис", "Объект", Отказ);
        Возврат;
    КонецЕсли;

    Для Каждого СтрокаТЧ Из ДокументацияСервиса Цикл
        Запись = Движения.ИТСервисы_ДокументацияСервисов.Добавить();
        Запись.Период          = МоментВремени();
        Запись.ИТСервис        = ИТСервис;
        Запись.ТипДокументации = СтрокаТЧ.ТипДокументации;

        Запись.Статус              = СтрокаТЧ.Статус;
        Запись.ДатаСоздания        = СтрокаТЧ.ДатаСоздания;
        Запись.НомерДокумента      = СтрокаТЧ.НомерДокумента;
        Запись.АвторДокумента      = ?(ЗначениеЗаполнено(СтрокаТЧ.АвторДокумента), 
                                       СтрокаТЧ.АвторДокумента, 
                                       ПараметрыСеанса.ТекущийПользователь);
        Запись.ОписаниеРеквизитов  = СтрокаТЧ.ОписаниеРеквизитов;
        Запись.ПутиИСсылки         = СтрокаТЧ.ПутиИСсылки;
        Запись.Примечание          = СтрокаТЧ.Примечание;
    КонецЦикла;


    // 2. Движения по параметрам сервиса — ВАРИАНТ А (самый надёжный)
    Движения.ИТСервисы_ПараметрыИТСервисов.Записывать = Истина;

    // Получаем состояние НА МОМЕНТ ДО этого документа
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    ПараметрыСрезПоследних.ДорожнаяКарта          КАК ДорожнаяКарта,
    |    ПараметрыСрезПоследних.ПаспортСервиса         КАК ПаспортСервиса,
    |    ПараметрыСрезПоследних.Архитектура            КАК Архитектура,
    |    ПараметрыСрезПоследних.БазаЗнаний             КАК БазаЗнаний,
    |    ПараметрыСрезПоследних.НаРазвитии             КАК Развитие,
    |    ПараметрыСрезПоследних.НаСопровождении        КАК Сопровождение,
    |    ПараметрыСрезПоследних.ПланПроектаВИСУП       КАК ПланПроектаВИСУП,
    |    ПараметрыСрезПоследних.КодВАРМРазработчика    КАК КодВАРМРазработчика
    |ИЗ
    |    РегистрСведений.ИТСервисы_ПараметрыИТСервисов.СрезПоследних(&МоментДо, ИТСервис = &ИТСервис) КАК ПараметрыСрезПоследних
    |УПОРЯДОЧИТЬ ПО
    |    ПараметрыСрезПоследних.Период УБЫВ";
    
    Запрос.УстановитьПараметр("ИТСервис", ИТСервис);
    Запрос.УстановитьПараметр("МоментДо", Новый Граница(МоментВремени(), ВидГраницы.Исключая));

    Выборка = Запрос.Выполнить().Выбрать();
    Текущее = Новый Структура("ДорожнаяКарта,ПаспортСервиса,Архитектура,БазаЗнаний,НаРазвитии,НаСопровождении,ПланПроектаВИСУП,КодВАРМРазработчика");

    Если Выборка.Следующий() Тогда
        ЗаполнитьЗначенияСвойств(Текущее, Выборка);
    КонецЕсли;

    // Создаём новую запись
    ЗаписьПараметров = Движения.ИТСервисы_ПараметрыИТСервисов.Добавить();
    ЗаписьПараметров.Период    = Дата;
    ЗаписьПараметров.ИТСервис  = ИТСервис;
   

    // Копируем ВСЁ предыдущее состояние
    ЗаполнитьЗначенияСвойств(ЗаписьПараметров, Текущее);

    // Обновляем только те поля, которые есть в табличной части документа
    Для Каждого СтрокаТЧ Из ДокументацияСервиса Цикл
 
        Тип = СтрокаТЧ.ТипДокументации;
 
        Если Тип = Справочники.ИТСервисы_ТипыДокументацииСервисов.НайтиПоНаименованию("Дорожная карта") Тогда
            ЗаписьПараметров.ДорожнаяКарта = Истина;
        Иначе
         ЗаписьПараметров.ДорожнаяКарта = Ложь;
        КонецЕсли;
 
        Если Тип = Справочники.ИТСервисы_ТипыДокументацииСервисов.НайтиПоНаименованию("Паспорт ИТ-сервиса") Тогда
            ЗаписьПараметров.ПаспортСервиса = Истина;
        Иначе
         ЗаписьПараметров.ПаспортСервиса = Ложь;
        КонецЕсли;
 
        Если Тип = Справочники.ИТСервисы_ТипыДокументацииСервисов.НайтиПоНаименованию("Архитектура") Тогда
            ЗаписьПараметров.Архитектура = Истина;
        Иначе
         ЗаписьПараметров.Архитектура = Ложь;
        КонецЕсли;
 
        Если Тип = Справочники.ИТСервисы_ТипыДокументацииСервисов.НайтиПоНаименованию("База знаний") Тогда
            ЗаписьПараметров.БазаЗнаний = Истина;
        Иначе
         ЗаписьПараметров.БазаЗнаний = Ложь;
        КонецЕсли;
 
    КонецЦикла;

КонецПроцедуры


// ОБРАБОТКА ПРОВЕРКИ ЗАПОЛНЕНИЯ
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// 1. Проверяем, что таблица не пустая
	Если ДокументацияСервиса.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена табличная часть 'Документация сервиса'!";
		Сообщение.Поле = "ДокументацияСервиса";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	// 2. Проверяем Обязательную Документацию (Устав и т.д.)
	ПроверитьОбязательнуюДокументацию(Отказ);
	
КонецПроцедуры

// ВСПОМОГАТЕЛЬНАЯ ПРОЦЕДУРА
Процедура ПроверитьОбязательнуюДокументацию(Отказ)
	
	// Ищем все типы документации, где стоит галочка "Обязательная"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Типы.Ссылка КАК ТипДокументации,
	|	Типы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ИТСервисы_ТипыДокументацииСервисов КАК Типы
	|ГДЕ
	|	Типы.ОбязательнаяДокументация = ИСТИНА
	|	И Типы.Активна = ИСТИНА";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Ищем этот тип в табличной части нашего документа
		НайденныеСтроки = ДокументацияСервиса.НайтиСтроки(
			Новый Структура("ТипДокументации", Выборка.ТипДокументации)
		);
		
		// Если не нашли - ругаемся
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			ТекстСообщения = СтрШаблон(
				"Для сервиса обязательно должен быть зарегистрирован документ типа '%1'!",
				Выборка.Наименование
			);
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Поле = "ДокументацияСервиса";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Отказ = Истина; 
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
